
перебрать числа ( ( с 1 по 20 ) отобрать нечётные каждое "увеличить на 1" "в обратном порядке" ) напечатать
// - печатаем нечётные числа + 1

"вывести разделитель"

перебрать числа ( ( с 1 по 20 ) отобрать чётные каждое "увеличить на 1" "в обратном порядке" ) напечатать
// - печатаем чётные числа + 1

"вывести разделитель"

перебрать числа ( ( с 1 по 20 ) отобрать нечётные каждое Dec1 "в обратном порядке" ) напечатать
// - печатаем нечётные числа - 1

"вывести разделитель"

перебрать числа ( ( с 1 по 20 ) отобрать чётные каждое Dec1 "в обратном порядке" ) напечатать
// - печатаем чётные числа - 1

"вывести разделитель"
