USES
 Translate.dict
;

перебрать ( ( 1 to 20 ) отобрать нечётные >map> Inc1 >reverted> ) напечатать
// - печатаем нечётные числа + 1
'-------------------' Print
перебрать ( ( 1 to 20 ) отобрать IsEven >map> Inc1 >reverted> ) напечатать
// - печатаем чётные числа + 1

перебрать ( ( 1 to 20 ) отобрать нечётные >map> Dec1 >reverted> ) напечатать
// - печатаем нечётные числа - 1
'-------------------' Print
перебрать ( ( 1 to 20 ) отобрать IsEven >map> Dec1 >reverted> ) напечатать
// - печатаем чётные числа - 1
