
перебрать числа ( ( с 1 по 20 ) отобрать нечётные каждое "увеличить на" 1 "в обратном порядке" ) напечатать
// - печатаем нечётные числа + 1

"вывести разделитель"

перебрать числа ( ( с 1 по 20 ) отобрать чётные каждое "увеличить на" 1 "в обратном порядке" ) напечатать
// - печатаем чётные числа + 1

"вывести разделитель"

перебрать числа ( ( с 1 по 20 ) отобрать нечётные каждое "уменьшить на 1" "в обратном порядке" ) напечатать
// - печатаем нечётные числа - 1

"вывести разделитель"

перебрать числа ( ( с 1 по 20 ) отобрать чётные каждое "уменьшить на 1" "в обратном порядке" ) напечатать
// - печатаем чётные числа - 1

"вывести разделитель"
